notes/circuits.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Circuits</title>
<meta name="generator" content="Org Mode" />
<link rel="icon" type="base/favicon" href="/base/favicon.png">
<link rel="stylesheet" href="https://www.haider.gq/base/style.css"/>
<link rel="stylesheet" href="https://www.haider.gq/base/table.css"/>
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/4.7.0/css/font-awesome.min.css" />
<link href="https://fonts.googleapis.com/css2?family=Roboto+Slab:wght@600&display=swap" rel="stylesheet">
</head>
<body>
<div id="preamble" class="status">
<header>
	  <a href='https://www.haider.gq' class='main_header'>Haider Mirza</a>
	  <nav>
	    <ul class='nav_links'>
	      <li><a href='https://www.haider.gq/projects/projects'>Projects</a></li>
	      <li><a href='https://www.haider.gq/blogs/blogs'>Blogs</a></li>
	      <li><a href='https://www.haider.gq/repos/repos'>Repositories</a></li>
	      <li><a href='https://www.haider.gq/notes'>Notes</a></li>
	    </ul>
	  </nav>
	</header>
</div>
<div id="content" class="content">
<h1 class="title">Circuits</h1>

<div id="outline-container-org9e6d12a" class="outline-2">
<h2 id="org9e6d12a">Electrical circuits</h2>
<div class="outline-text-2" id="text-org9e6d12a">
</div>
<div id="outline-container-orgdc1746b" class="outline-3">
<h3 id="orgdc1746b">Voltage</h3>
<div class="outline-text-3" id="text-orgdc1746b">
<p>
Voltage is the amount of energy in Joules avalable to move 1 coulumb of charge.
</p>

<p>
\(Voltage = \frac{work(energy)}{q(charge)}\)
</p>
</div>
</div>
<div id="outline-container-orgbd7c193" class="outline-3">
<h3 id="orgbd7c193">Electric charge</h3>
<div class="outline-text-3" id="text-orgbd7c193">
<p>
Charles-Augustin de Coulomb said that there was obviously something flowing inside a conductive medium like a fluid and let's call that electric charge.
The unit for electric charge is Coulomb, and it's symbol is "q".
</p>
</div>
<div id="outline-container-org7076954" class="outline-4">
<h4 id="org7076954">Coulomb's Law</h4>
<div class="outline-text-4" id="text-org7076954">
<p>
I really wont go into this as I do not understand it enough but here is the gist of it:
[<a target='_blank' rel='noopener noreferrer' class='external' href="https://www.haider.gq/images/do-not-delete/Notes/coloumb-law">https://www.haider.gq/images/do-not-delete/Notes/coloumb-law</a>]
\(F = K_e \frac{q_1 * q_2}{r^2}\)
</p>
</div>
</div>
</div>
<div id="outline-container-org3776531" class="outline-3">
<h3 id="org3776531">Current</h3>
<div class="outline-text-3" id="text-org3776531">
<p>
An electric current is a stream of charged particles, such as electrons or ions, moving through an electrical conductor or space.
<b>NOTE:</b> Electrons have a negative charge and flow from negative to postitive. Current is positive to negative.
(When scientists discovered that electron moves from negative to positive instead of positive to negative, they just left current as it is as all calculations will still work)
</p>

<p>
At it's core, Current is the amount of charge in coulomb passing in one second
</p>
</div>

<div id="outline-container-org02c1d6f" class="outline-4">
<h4 id="org02c1d6f">Calculating current</h4>
<div class="outline-text-4" id="text-org02c1d6f">
<p>
You can calculate current with the formula
Current is measured in Amps(A) and is represented as 'I'.
</p>

<p>
\(Current = \frac{charge}{time}\)
or:
\(I = \frac{Q}{T}\)
</p>
</div>
</div>
</div>
<div id="outline-container-org6f45dbe" class="outline-3">
<h3 id="org6f45dbe">Resistance</h3>
<div class="outline-text-3" id="text-org6f45dbe">
<p>
Passing electrons have to try and move their way accross many vibrating elections.
The atoms try and stop the electrons from passing like fighting against a strong gale. 
</p>
</div>
</div>
<div id="outline-container-orgef902bc" class="outline-3">
<h3 id="orgef902bc">Series Circuits</h3>
<div class="outline-text-3" id="text-orgef902bc">
<p>
In fully series circuits, the current at any point in the circuit is the same.
Ampmeters are usually connected in series as a Ampmeter measures current and has a very low resistance.
</p>
</div>
</div>
<div id="outline-container-org3a94cff" class="outline-3">
<h3 id="org3a94cff">Parallel Circuits</h3>
<div class="outline-text-3" id="text-org3a94cff">
<p>
Current gets <b>shared</b> between branches but voltage stays the <b>same</b>.
A Voltmeter should always be connected in Parallel because of it's large resistance.
</p>
</div>
</div>
</div>

<div id="outline-container-org9718e71" class="outline-2">
<h2 id="org9718e71">Links to this note</h2>
<div class="outline-text-2" id="text-org9718e71">
<ul class="org-ul">
<li><a href="./physics.html">Physics</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer>
	  <div class='footer-content'>
	    <h3>Haider Mirza</h3>
	    <p>Website created by Haider Mirza</p>
	    <ul class='socials'>
	      <li><a href='https://www.github.com/Haider-Mirza'><i class='fa fa-github'></i></a></li>
	      <li><a href='mailto:haider@haider.gq'><i class='fa fa-envelope'></i></a></li>
	    </ul>
	  </div>
	  <div class='footer-bottom'>
	    <p>Created by Haider Mirza with orgmode in emacs</p>
	  </div>
	</footer>
</div>
</body>
</html>
